/* Необхідно написати програму яка буде виводити інформацію за умовами при яких число виводитиметься з правильним словом: "рік", 
"роки" або "років". Тобто. "29 років" чи "4 роки".
Умови виконання ДЗ: Рік отримувати через prompt()
Зробити перевірку що користувачь ввів число та це число не є відємним */

let year = +prompt('Ваш вік:');
let ageTxt;
if (year < 0) {
    console.log('Вік не може бути менше 0');
} else {
    if (year % 10 === 1 && (year % 100 < 11 || year % 100 > 14)) {
        ageTxt = 'рік';
    } else if ((year % 10 === 2 || year % 10 === 3 || year % 10 === 4) && (year % 100 < 11 || year % 100 > 14)) {
        ageTxt = 'роки';
    } else {
        ageTxt = 'років';
    }
}

console.log(`Тобі: ${year} ${ageTxt}`);